/* Програма призначена для обчислення і виведення на екран:
- різниці 2-го числа та 1-го;
- середнє арифметичне двох чисел;
- суму чисел.*/

#include <stdio.h>//Підключення потрібних для роботи бібліотек
#include <math.h>

int main() {
	int a, b;   //вводимо змінні
	int A, B, C;
	printf("Привіт! Будь ласка \n");//Просимо юзера ввести данні для обчислення
	printf("Задайте число A:");
	scanf_s("%d",&a);

	printf("Задайте число B:");
	scanf_s("%d", &b);
	
	A = b - a;  // Обчислення різниці між числом b та a

	B = (a + b) / 2; // Середнє арифметичне

	C = a + b; // Сума 

	printf("Різниця числа B від А: %d\n", A);// Виведення інформації на екран юзера 
	printf("Середнє арифметичне: %d\n", B);
	printf("Сума: %d\n", C);


	return 0;//кінець програми. Увага! на момент написання все працює правильно Visual Studio не матюкається...
}
